#+TITLE: Leetcode
#+DATE: 2023-10-22T01:43:48+09:00
#+PUBLISHDATE: 2023-10-22T01:43:48+09:00
#+DRAFT: nil
#+CATEGORIES[]: nil nil
#+TAGS[]: Array BinarySearch Sorting PrefixSum
#+DESCRIPTION: Short description
[[https://leetcode.com/problems/minimum-operations-to-make-all-array-elements-equal/description/][Minimum Operations to Make All Array Elements Equal - LeetCode]]


* gcd(greatest common divisor), HCF(highest common factor)
making least common multiple with gcd
{{<details "Solution">}}
#+begin_src python :results output
from math import gcd
def nlcm(num): # least common multiple
    answer = num[0]
    for n in num:
        answer = n * answer // int(gcd(n, answer))

    return answer

# 아래는 테스트로 출력해 보기 위한 코드입니다.
print(nlcm([2,6,8,14]));
# {2:3, 3:1, 7:1} => 8 * 3 * 7 = 168
#+end_src

#+RESULTS:
: 168
{{</details>}}

* BFS with two stacks(not queue) // normally BFS use queue
{{<details "Solution">}}
#+begin_src python :results output
def test():
    mat = [[0] * 5 for _ in range(5)]
    seen = [[False] * 5 for _ in range(5)]
    start = (2, 2)
    st1 = list()
    st2 = list()
    st1.append(start)
    dy = [0, 0, 1, -1]
    dx = [-1, 1, 0, 0]
    depth = 1

    print()
    while (st1 or st2):
        print(f'depth: {depth}, stack1: {st1}, stack2: {st2}')
        stlen = len(st1) if depth % 2 == 1 else len(st2)
        while (stlen):
            stlen -= 1

            (y,x) = st1.pop() if depth % 2 == 1 else st2.pop()
            seen[y][x] = True
            mat[y][x] = depth

            for i in range(4):
                ny = y + dy[i]
                nx = x + dx[i]

                if ny < 0 or ny > 4 or nx < 0 or nx > 4: continue
                if seen[ny][nx]: continue

                seen[ny][nx] = True

                if depth % 2 == 1: st2.append((ny,nx))
                else: st1.append((ny,nx))
        depth += 1
    print()
    for i in mat:
        print(i)
    print()
test()

#+end_src

#+RESULTS:
#+begin_example

depth: 1, stack1: [(2, 2)], stack2: []
depth: 2, stack1: [], stack2: [(2, 1), (2, 3), (3, 2), (1, 2)]
depth: 3, stack1: [(1, 1), (1, 3), (0, 2), (3, 1), (3, 3), (4, 2), (2, 4), (2, 0)], stack2: []
depth: 4, stack1: [], stack2: [(3, 0), (1, 0), (3, 4), (1, 4), (4, 1), (4, 3), (0, 1), (0, 3)]
depth: 5, stack1: [(0, 4), (0, 0), (4, 4), (4, 0)], stack2: []

[5, 4, 3, 4, 5]
[4, 3, 2, 3, 4]
[3, 2, 1, 2, 3]
[4, 3, 2, 3, 4]
[5, 4, 3, 4, 5]
#+end_example
{{</details>}}

* Verify Preorder Sequence in Binary Search Tree
[[https://leetcode.com/problems/verify-preorder-sequence-in-binary-search-tree/description/][Verify Preorder Sequence in Binary Search Tree - LeetCode]]

{{<details "Solution">}}
#+begin_src python :results output
from collections import Counter
from typing import List
from heapq import *

inf = float('inf')

class Solution:
    def verifyPreorder(self, preorder: List[int]) -> bool:
        gi = 0
        def helper(min_limit, max_limit):
            nonlocal gi
            if gi == len(preorder):
                return True

            root = preorder[gi]
            print(f'{root, min_limit, max_limit = }')
            if not min_limit < root < max_limit:
                return False

            gi += 1
            left = helper(min_limit, root)
            right = helper(root, max_limit)

            return left or right

        return helper(-inf, inf)

class Solution2:
    def verifyPreorder(self, preorder: List[int]) -> bool:
        min_limit = -inf
        stack = []

        for num in preorder:
            print(f'{stack, num = }')
            while stack and stack[-1] < num:
                min_limit = stack.pop()

            print(f'{stack, min_limit = }')
            if num <= min_limit:
                return False

            stack.append(num)

        return True

print(Solution().verifyPreorder([5,2,1,3,6])) # True
print(Solution().verifyPreorder([5,2,6,1,3])) # True

#+end_src

#+RESULTS:
#+begin_example
root, min_limit, max_limit = (5, -inf, inf)
root, min_limit, max_limit = (2, -inf, 5)
root, min_limit, max_limit = (1, -inf, 2)
root, min_limit, max_limit = (3, -inf, 1)
root, min_limit, max_limit = (3, 1, 2)
root, min_limit, max_limit = (3, 2, 5)
root, min_limit, max_limit = (6, 2, 3)
root, min_limit, max_limit = (6, 3, 5)
root, min_limit, max_limit = (6, 5, inf)
True
root, min_limit, max_limit = (5, -inf, inf)
root, min_limit, max_limit = (2, -inf, 5)
root, min_limit, max_limit = (6, -inf, 2)
root, min_limit, max_limit = (6, 2, 5)
root, min_limit, max_limit = (6, 5, inf)
root, min_limit, max_limit = (1, 5, 6)
root, min_limit, max_limit = (1, 6, inf)
False
#+end_example
{{</details>}}
